### 1. Read a CSV file named as Toyota and create a dataframe

In [2]:
import pandas as pd
cars = pd.read_csv('Toyota.csv')

### 1.1 Read CSV by making left most column as index

In [3]:
cars = pd.read_csv('Toyota.csv',index_col=0)

### 2. Print the details about the dataframe such as number of columns, datatype of columns and number of null-values

In [4]:
print(cars.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1436 non-null   object
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 123.4+ KB
None

### 3. Print statistical details of numerical fields

In [5]:
cars.describe()

,Price,Age,MetColor,Automatic,CC,Weight
count,1436.000000,1336.000000,1286.000000,1436.000000,1436.000000,1436.00000
mean,10730.824513,55.672156,0.674961,0.055710,1566.827994,1072.45961
std,3626.964585,18.589804,0.468572,0.229441,187.182436,52.64112
min,4350.000000,1.000000,0.000000,0.000000,1300.000000,1000.00000
25%,8450.000000,43.000000,0.000000,0.000000,1400.000000,1040.00000
50%,9900.000000,60.000000,1.000000,0.000000,1600.000000,1070.00000
75%,11950.000000,70.000000,1.000000,0.000000,1600.000000,1085.00000
max,32500.000000,80.000000,1.000000,1.000000,2000.000000,1615.00000

### 4. Print statistical details of non-numeric data

In [6]:
cars.describe(exclude=[float,int])

          KM FuelType    HP Doors
count   1436     1336  1436  1436
unique  1256        3    13     7
top       ??   Petrol   110     5
freq      15     1177   833   673

### 5. Print number of null values in each column

In [7]:
cars.isnull().sum()

Price          0
Age          100
KM             0
FuelType     100
HP             0
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

### 6. Find the number of records in the file

In [8]:
cars.shape

(1436, 10)

### 7 Print first seven records of the dataframe and last 9 records

In [9]:
cars.head(7)

   Price   Age     KM FuelType    HP  MetColor  Automatic    CC  Doors  Weight
0  13500  23.0  46986   Diesel    90       1.0          0  2000  three    1165
1  13750  23.0  72937   Diesel    90       1.0          0  2000      3    1165
2  13950  24.0  41711   Diesel    90       NaN          0  2000      3    1165
3  14950  26.0  48000   Diesel    90       0.0          0  2000      3    1165
4  13750  30.0  38500   Diesel    90       0.0          0  2000      3    1170
5  12950  32.0  61000   Diesel    90       0.0          0  2000      3    1170
6  16900  27.0     ??   Diesel  ????       NaN          0  2000      3    1245

In [10]:
cars.tail(9)

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
1427,8950,NaN,29000,Petrol,86,1.0,1,1300,3,1045
1428,8450,72.0,??,Petrol,86,NaN,0,1300,3,1015
1429,8950,78.0,24000,Petrol,86,1.0,1,1300,5,1065
1430,8450,80.0,23000,Petrol,86,0.0,0,1300,3,1015
1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,10845,72.0,??,Petrol,86,0.0,0,1300,3,1015
1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

### 8. Create a dataframe car_deisel with only vehicles that has fueltype as diesel

In [11]:
cars = pd.read_csv('Toyota.csv',index_col='FuelType')

In [12]:
cars_deisel = cars.loc['Diesel']

In [13]:
cars_deisel.count()

Unnamed: 0    144
Price         144
Age           137
KM            144
HP            144
MetColor      127
Automatic     144
CC            144
Doors         144
Weight        144
dtype: int64

### 9. Print all details of record with index value as 100

In [14]:
cars = pd.read_csv('Toyota.csv',index_col=0)
cars.loc[100]

Price         18990
Age            20.0
KM            23175
FuelType     Petrol
HP              110
MetColor        1.0
Automatic         0
CC             1600
Doors             3
Weight         1120
Name: 100, dtype: object

### 10. Print all values of a column with internal index as 2

In [15]:
cars.iloc[:,2]

0       46986
1       72937
2       41711
3       48000
4       38500
        ...
1431    20544
1432       ??
1433    17016
1434       ??
1435        1
Name: KM, Length: 1436, dtype: object

### 11. Get all columns of records with index value 10 to 20

In [16]:
rows = cars.loc[10:20]
print(type(rows))
print(rows)

<class 'pandas.core.frame.DataFrame'>
    Price   Age     KM FuelType    HP  MetColor  Automatic    CC Doors  Weight
10  20950  25.0  31461   Petrol   192       0.0          0  1800     3    1185
11  19950  22.0  43610   Petrol   192       0.0          0  1800     3    1185
12  19600  25.0  32189   Petrol   192       0.0          0  1800     3    1185
13  21500  31.0  23000   Petrol   192       1.0          0  1800     3    1185
14  22500  32.0  34131   Petrol   192       1.0          0  1800     3    1185
15  22000  28.0  18739   Petrol  ????       0.0          0  1800     3    1185
16  22750  30.0  34000   Petrol   192       1.0          0  1800     3    1185
17  17950  24.0  21716   Petrol   110       1.0          0  1600     3    1105
18  16750  24.0  25563   Petrol   110       0.0          0  1600     3    1065
19  16950  30.0  64359   Petrol   110       1.0          0  1600     3    1105
20  15950  30.0  67660   Petrol   110       1.0          0  1600     3    1105

### 12. Get columns KM and FuelType of records with index value 10 to 20

In [17]:
rows = cars.loc[10:20,['KM']]
print(type(rows))
print(rows)

<class 'pandas.core.frame.DataFrame'>
       KM
10  31461
11  43610
12  32189
13  23000
14  34131
15  18739
16  34000
17  21716
18  25563
19  64359
20  67660

### 13. Get columns KM to  Automatic of records with index value 10 to 20

In [18]:
rows = cars.loc[10:20,'KM':'Automatic']
print(type(rows))
print(rows)

<class 'pandas.core.frame.DataFrame'>
       KM FuelType    HP  MetColor  Automatic
10  31461   Petrol   192       0.0          0
11  43610   Petrol   192       0.0          0
12  32189   Petrol   192       0.0          0
13  23000   Petrol   192       1.0          0
14  34131   Petrol   192       1.0          0
15  18739   Petrol  ????       0.0          0
16  34000   Petrol   192       1.0          0
17  21716   Petrol   110       1.0          0
18  25563   Petrol   110       0.0          0
19  64359   Petrol   110       1.0          0
20  67660   Petrol   110       1.0          0

### 14. Find the count of unique values of column KM in the dataset

In [19]:
cars['KM'].value_counts()

??       15
1         8
43000     7
36000     7
59000     7
         ..
64690     1
46029     1
67010     1
56074     1
91399     1
Name: KM, Length: 1256, dtype: int64

### 15. Replace '??' in KM by mean of 'KM' column

In [20]:
cars_dup = pd.read_csv('Toyota.csv',index_col=0,na_values=['??'])
mean_val = cars_dup['KM'].mean()
cars['KM'].replace('??',mean_val,inplace=True)
cars['KM'].value_counts()

68647.23997185081    15
1                     8
36000                 7
59000                 7
43000                 7
                     ..
64690                 1
46029                 1
67010                 1
56074                 1
91399                 1
Name: KM, Length: 1256, dtype: int64

### 16. Find the count of unique values of Door

In [21]:
cars['Doors'].value_counts()

5        673
3        621
4        137
2          2
five       1
three      1
four       1
Name: Doors, dtype: int64

### 17. Replace three, four and five by 3,4,5 respectively

In [22]:
cars.Doors.replace('three',3,inplace=True)
cars.Doors.replace('four',4,inplace=True)
cars.Doors.replace('five',5,inplace=True)
#cars.Doors.value_counts()
cars.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1436 non-null   object
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 155.7+ KB

### 18. Convert Doors column to integer

In [23]:
cars['Doors'] = cars['Doors'].astype(int)
cars.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1436 non-null   object
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   int64
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(5), object(3)
memory usage: 155.7+ KB

### 19  Create a dataframe with all cars price less than or equal to 10,000

In [24]:
low_price = cars[cars.Price<=10000]
print(low_price)

      Price   Age            KM FuelType   HP  MetColor  Automatic    CC  \
186    6950  43.0        243000   Diesel   69       0.0          0  1900
187    9500  38.0        180638   Diesel   90       0.0          0  2000
189    7750  43.0        178858      CNG  110       0.0          0  1600
191    4350  44.0        158320   Diesel   69       0.0          0  1800
192    4750  44.0        131273   Diesel   69       1.0          0  1800
...     ...   ...           ...      ...  ...       ...        ...   ...
1430   8450  80.0         23000   Petrol   86       0.0          0  1300
1431   7500   NaN         20544   Petrol   86       1.0          0  1300
1433   8500   NaN         17016   Petrol   86       0.0          0  1300
1434   7250  70.0  68647.239972      NaN   86       1.0          0  1300
1435   6950  76.0             1   Petrol  110       0.0          0  1600

      Doors  Weight
186       3    1110
187       4    1160
189       3    1084
191       5    1110
192       5    1110
...     ...     ...
1430      3    1015
1431      3    1025
1433      3    1015
1434      3    1015
1435      5    1114

[825 rows x 10 columns]

### 20. Find the number of cars with price >10,000

In [25]:
sum(cars['Price']<=10000)

825

### 21. Find the number of cars with price >10,000 and less than 20,000

In [26]:
sum((cars['Price']>10000) & (cars['Price']<20000))

574

### 22. Form a dataframe with car prices from 10,000 to 20,000

In [27]:
medium = cars[(cars.Price>10000) &
               (cars.Price<20000)]

In [28]:
medium

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,13500,23.0,46986,Diesel,90,1.0,0,2000,3,1165
1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...
1042,10950,67.0,15535,Petrol,86,NaN,1,1300,4,1030
1058,10500,77.0,172980,Diesel,72,NaN,0,2000,5,1135
1383,10950,76.0,53133,Petrol,110,1.0,0,1600,5,1070
1402,10500,NaN,47400,Petrol,86,1.0,0,1300,5,1040
1432,10845,72.0,68647.239972,Petrol,86,0.0,0,1300,3,1015

### 23. Print the data with index 5 and column name as CC

In [29]:
print(cars.at[9,"CC"])

1900

### 24. Print data with internally indices of Pandas, row index 3 and column index as 3

In [30]:
print(cars.iat[8,3])

Petrol

### 25. Decrease the Price of all cars by 10%

In [31]:
def reduce(val):
    return val*0.9

cars = pd.read_csv('Toyota.csv',index_col=0)
print(cars['Price'])
cars['Price'] = reduce(cars['Price'])
print(cars['Price'])

0       13500
1       13750
2       13950
3       14950
4       13750
        ...
1431     7500
1432    10845
1433     8500
1434     7250
1435     6950
Name: Price, Length: 1436, dtype: int64
0       12150.0
1       12375.0
2       12555.0
3       13455.0
4       12375.0
         ...
1431     6750.0
1432     9760.5
1433     7650.0
1434     6525.0
1435     6255.0
Name: Price, Length: 1436, dtype: float64

### 26. insert a new column price category after Price

In [32]:
cars.insert(2,'Price Category','')

In [122]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Price           1436 non-null   int64
 1   Age             1336 non-null   float64
 2   Price Category  1436 non-null   object
 3   KM              1436 non-null   object
 4   FuelType        1336 non-null   object
 5   HP              1436 non-null   object
 6   MetColor        1286 non-null   float64
 7   Automatic       1436 non-null   int64
 8   CC              1436 non-null   int64
 9   Doors           1436 non-null   object
 10  Weight          1436 non-null   int64
dtypes: float64(2), int64(4), object(5)
memory usage: 134.6+ KB

### 27. Assign price category of car as low, medium or high

In [33]:
for i in range(0, len(cars['Price'])):    
    
    if cars['Price'][i]<10000:
        
        cars.loc[i, 'Price Category']='low'
    elif (cars['Price'][i]<20000):
        
        cars.loc[i, 'Price Category']='medium'
    else:        
        cars.loc[i, 'Price Category']='high'

In [126]:
print(cars)

      Price   Age Price Category     KM FuelType   HP  MetColor  Automatic  \
0     13500  23.0         medium  46986   Diesel   90       1.0          0
1     13750  23.0         medium  72937   Diesel   90       1.0          0
2     13950  24.0         medium  41711   Diesel   90       NaN          0
3     14950  26.0         medium  48000   Diesel   90       0.0          0
4     13750  30.0         medium  38500   Diesel   90       0.0          0
...     ...   ...            ...    ...      ...  ...       ...        ...
1431   7500   NaN            low  20544   Petrol   86       1.0          0
1432  10845  72.0         medium     ??   Petrol   86       0.0          0
1433   8500   NaN            low  17016   Petrol   86       0.0          0
1434   7250  70.0            low     ??      NaN   86       1.0          0
1435   6950  76.0            low      1   Petrol  110       0.0          0

        CC  Doors  Weight
0     2000  three    1165
1     2000      3    1165
2     2000      3    1165
3     2000      3    1165
4     2000      3    1170
...    ...    ...     ...
1431  1300      3    1025
1432  1300      3    1015
1433  1300      3    1015
1434  1300      3    1015
1435  1600      5    1114

[1436 rows x 11 columns]

### 28. Drop all rows with null values

In [34]:
cars.isnull().sum()

Price               0
Age               100
Price Category      0
KM                  0
FuelType          100
HP                  0
MetColor          150
Automatic           0
CC                  0
Doors               0
Weight              0
dtype: int64

In [130]:
cars.dropna(inplace = True)

### 29. Fill missing values of KM with mean, median mode

In [35]:
import pandas as pd
cars = pd.read_csv('Toyota.csv',index_col=0,na_values=['??'])
print(cars)

      Price   Age       KM FuelType   HP  MetColor  Automatic    CC  Doors  \
0     13500  23.0  46986.0   Diesel   90       1.0          0  2000  three
1     13750  23.0  72937.0   Diesel   90       1.0          0  2000      3
2     13950  24.0  41711.0   Diesel   90       NaN          0  2000      3
3     14950  26.0  48000.0   Diesel   90       0.0          0  2000      3
4     13750  30.0  38500.0   Diesel   90       0.0          0  2000      3
...     ...   ...      ...      ...  ...       ...        ...   ...    ...
1431   7500   NaN  20544.0   Petrol   86       1.0          0  1300      3
1432  10845  72.0      NaN   Petrol   86       0.0          0  1300      3
1433   8500   NaN  17016.0   Petrol   86       0.0          0  1300      3
1434   7250  70.0      NaN      NaN   86       1.0          0  1300      3
1435   6950  76.0      1.0   Petrol  110       0.0          0  1600      5

      Weight
0       1165
1       1165
2       1165
3       1165
4       1170
...      ...
1431    1025
1432    1015
1433    1015
1434    1015
1435    1114

[1436 rows x 10 columns]

In [36]:
cars['FuelType'].value_counts()

Petrol    1177
Diesel     144
CNG         15
Name: FuelType, dtype: int64

In [37]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(3), int64(4), object(3)
memory usage: 123.4+ KB

In [38]:
cars.FuelType.nbytes

11488

In [39]:
cars['FuelType'] = cars.FuelType.astype('category')

In [40]:
mean_val = cars['KM'].mean()

In [41]:
cars['KM'] = cars['KM'].fillna(mean_val)

In [42]:
cars.iloc[6]

Price               16900
Age                  27.0
KM           68647.239972
FuelType           Diesel
HP                   ????
MetColor              NaN
Automatic               0
CC                   2000
Doors                   3
Weight               1245
Name: 6, dtype: object

In [43]:
cars = pd.read_csv('Toyota.csv',index_col=0,na_values=['??'])
median_val = cars['KM'].median()
cars['KM'] = cars['KM'].fillna(median_val)
cars.iloc[6]

Price          16900
Age             27.0
KM           63634.0
FuelType      Diesel
HP              ????
MetColor         NaN
Automatic          0
CC              2000
Doors              3
Weight          1245
Name: 6, dtype: object

In [44]:
cars = pd.read_csv('Toyota.csv',index_col=0,na_values=['??'])
mode_val = cars['KM'].mode()[0]
print(mode_val)
cars['KM'] = cars['KM'].fillna(mode_val)
cars.iloc[6]

1.0

Price         16900
Age            27.0
KM              1.0
FuelType     Diesel
HP             ????
MetColor        NaN
Automatic         0
CC             2000
Doors             3
Weight         1245
Name: 6, dtype: object